// Конфигурация категорий и списка опций

export const RANKS = [
    "Новобранец", "Рядовой", "Ефрейтор", "Мл.Сержант", "Сержант", "Ст.Сержант", 
    "Старшина", "Прапорщик", "Ст.Прапорщик", "Мл.Лейтенант", "Лейтенант", 
    "Ст.Лейтенант", "Капитан", "Майор", "Подполковник", "Полковник", 
    "Ген.Майор", "Ген.Лейтенант", "Ген.Полковник", "Ген.Армии", "Маршал"
];

export const TOGGLE_CATEGORIES = {
    vvs: {
        dbColumn: "pCYP",
        title: "Допуски ВВС",
        options: ["Транспортные вертолёты", "Боевые вертолёты", "Транспортные самолёты", "Боевые самолёты"]
    },
    btv: {
        dbColumn: "pBTV",
        title: "Допуски БТВ",
        options: ["Механик-водитель БМП", "Гусеничная средняя техника", "Гусеничная тяжелая техника", "Артиллерия"]
    },
    rp: {
        dbColumn: "pRP",
        title: "🧭 Допуски РП",
        options: ["Зевс", "Повстанец", "Стрингер", "Красный Крест", "НАТО", "Легионер"]
    },
    kmb: {
        dbColumn: "pKMB",
        title: "Инструктора (КМБ)",
        options: ["Лётчиков", "Танкистов", "РП сторон", "Новобранцев", "Офицеров", "Снайперов", "Инженеров", "Медиков"]
    },
    courses: {
        dbColumn: "pSkill",
        title: "Курсы и Навыки",
        options: ["Офицер", "Инженер", "Снайпер", "Медик", "Кадет", "ССО"]
    },
    boss: {
        dbColumn: "pBoss",
        title: "Допуски Руководства",
        options: ["Админ", "Тех.Поддержка", "Заместитель", "Разработчик"]
    },
    admin: {
        dbColumn: "pAdmin",
        title: "Админ-права",
        options: []
    },
};

export const PRESET_COLORS = [
    { label: '🔴 Ярко-красный', value: '#FF0000', emoji: '🔴' },
    { label: '🌸 Розовый неон', value: '#FF1493', emoji: '🌸' },
    { label: '🟡 Золотой', value: '#FFD700', emoji: '🟡' },
    { label: '🟢 Зеленый', value: '#00FF00', emoji: '🟢' },
    { label: '🔵 Небесно-голубой', value: '#00BFFF', emoji: '🔵' },
    { label: '🟣 Пурпурный', value: '#8A2BE2', emoji: '🟣' },
    { label: '⚪ Белый / Стандартный', value: '#FFFFFF', emoji: '⚪' },
];

export const ADMIN_LEVELS: Record<string, string> = {
    "0": "Нет прав",
    "1": "Главком ВС РФ",
    "2": "Руководитель Проекта",
    "3": "Администратор",
    "4": "Главный Администратор",
    "5": "Куратор Администрации",
    "6": "Зам. Руководителя Проекта",
    "7": "Тех. Зевс"
};

export const ADMIN_PANEL_OPTIONS: Record<string, string> = {
    "0": "Нет доступа к ВП-панели",
    "1": "Есть доступ к ВП-панели"
};