// Конфигурация категорий и списка опций

export const RANKS = [
    "Новобранец", "Рядовой", "Ефрейтор", "Мл.Сержант", "Сержант", "Ст.Сержант", 
    "Старшина", "Прапорщик", "Ст.Прапорщик", "Мл.Лейтенант", "Лейтенант", 
    "Ст.Лейтенант", "Капитан", "Майор", "Подполковник", "Полковник", 
    "Ген.Майор", "Ген.Лейтенант", "Ген.Полковник", "Ген.Армии", "Маршал"
];

export const UNITS: Record<string, string> = {
    "0": "Без отряда",
    "238446": "ЦСН Альфа",
    "234940": "ОСН Тайфун",
    "239203": "G4S",
    "234325": "ЧВК Спарта",
    "225436": "ССО",
    "234330": "ОМОН",
    "234331": "УСН ФСО",
    "203036": "ОТГ 141",
    "234235": "Nord Squad",
    "234142": "Легион",
    "234433": "СОБР",
    "234238": "ЧВК Bear",
    "234224": "Авангард",
    "234001": "North Response Force",
    "234236": "Академия Тайфун",
    "234111": "Безликие"
};

export const TOGGLE_CATEGORIES = {
    vvs: {
        dbColumn: "pCYP",
        title: "Допуски ВВС",
        options: ["Транспортные вертолёты", "Боевые вертолёты", "Транспортные самолёты", "Боевые самолёты"]
    },
    btv: {
        dbColumn: "pBTV",
        title: "Допуски БТВ",
        options: ["Механик-водитель БМП", "Гусеничная средняя техника", "Гусеничная тяжелая техника", "Артиллерия"]
    },
    rp: {
        dbColumn: "pRP",
        title: "🧭 Допуски РП",
        options: ["Зевс", "Повстанец", "Стрингер", "Красный Крест", "НАТО", "Легионер"]
    },
    kmb: {
        dbColumn: "pKMB",
        title: "Инструктора (КМБ)",
        options: ["Лётчиков", "Танкистов", "РП сторон", "Новобранцев", "Офицеров", "Снайперов", "Инженеров", "Медиков"]
    },
    courses: {
        dbColumn: "pSkill",
        title: "Курсы и Навыки",
        options: ["Офицер", "Инженер", "Снайпер", "Медик", "Кадет", "ССО"]
    },
    boss: {
        dbColumn: "pBoss",
        title: "Допуски Руководства",
        options: ["Админ", "Тех.Поддержка", "Заместитель", "Разработчик"]
    }
};

export const PRESET_COLORS = [
    { label: '🔴 Ярко-красный', value: '#FF0000', emoji: '🔴' },
    { label: '🌸 Розовый неон', value: '#FF1493', emoji: '🌸' },
    { label: '🟡 Золотой', value: '#FFD700', emoji: '🟡' },
    { label: '🟢 Зеленый', value: '#00FF00', emoji: '🟢' },
    { label: '🔵 Небесно-голубой', value: '#00BFFF', emoji: '🔵' },
    { label: '🟣 Пурпурный', value: '#8A2BE2', emoji: '🟣' },
    { label: '⚪ Белый / Стандартный', value: '#FFFFFF', emoji: '⚪' },
];